#Область ОбработчикиСобытийЭлементовТаблицыФормыПродажаРыб_таблица
&НаКлиенте
Процедура ПродажаРыб_таблицаКоличествоПриИзменении(Элемент)
	Строка = Элементы.ПродажаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ПродажаРыб_таблицаЦенаПродажиПриИзменении(Элемент)
	Строка = Элементы.ПродажаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Строка);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСумму(Строка)
	Если ЗначениеЗаполнено(Строка.Количество) И ЗначениеЗаполнено(Строка.ЦенаПокупки) Тогда
		Строка.Сумма = Окр(Строка.Количество * Строка.ЦенаПокупки, 2);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
