#Область ОбработчикиСобытийЭлементовТаблицыФормыПокупкаРыб_таблица
&НаКлиенте
Процедура ПокупкаРыб_таблицаКоличествоПриИзменении(Элемент)
	Сторка = Элементы.ПокупкаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Сторка);
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаРыб_таблицаЦенаПокупкиПриИзменении(Элемент)
	Сторка = Элементы.ПокупкаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Сторка);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСумму(Строка)
	Если ЗначениеЗаполнено(Строка.Количество) И ЗначениеЗаполнено(Строка.ЦенаПокупки) Тогда
		Строка.Сумма = Окр(Строка.Количество * Строка.ЦенаПокупки, 2);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
