#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиПоРыбе.Записывать = Истина;
	
	Для Каждого Строка Из ПокупкаРыб_таблица Цикл
		Движение = Движения.ОстаткиПоРыбе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
		Движение.Аквариум = Строка.Аквариум;
		Движение.ПородаРыб = Строка.ПородаРыб;
		Движение.Количество = Строка.Количество;
		Движение.Стоимость = Строка.Сумма;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
