#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиПоРыбам.Записывать = Истина;
	Движения.РегистрПродажи.Записывать = Истина;
	
	
	ЗапросПоОстаткам = Новый Запрос;
	ЗапросПоОстаткам.Текст = "ВЫБРАТЬ
	|	т.Аквариум КАК Аквариум,
	|	т.ПородаРыб КАК Порода,
	|	т.КоличествоОстаток КАК Количество,
	|	т.СтоимостьОстаток КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ОстаткиПоРыбам.Остатки(&МоментВремени) КАК т";
	ЗапросПоОстаткам.УстановитьПараметр("МоментВремени", МоментВремени());
	Таблица = ЗапросПоОстаткам.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ПродажаРыб_таблица Цикл
		Отбор = Новый Структура("Аквариум, Порода", Строка.Аквариум, Строка.ПородаРыб);
		РезультатПоиска = Таблица.НайтиСтроки(Отбор);
		
		ОстатокКоличество = 0;
		ОстатокСтоимость = 0;
		
		Если РезультатПоиска.Количество() > 0 Тогда
			ОстатокКоличество = РезультатПоиска[0].Количество;
			ОстатокСтоимость = РезультатПоиска[0].Стоимость;
		КонецЕсли;
		
		Если ОстатокКоличество < Строка.Количество Тогда
			Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Недостаточно рыб: " + Строка.ПородаРыб
                + " в " + Строка.Аквариум;
            Сообщение.Сообщить();
            Отказ = Истина;
            Возврат;
		КонецЕсли;
		
		СредняяСебестоимость = ОстатокСтоимость / ОстатокКоличество;
		СебестоимостьСписания = СредняяСебестоимость * Строка.Количество;
		
		ДвижениеОстатки = Движения.ОстаткиПоРыбам.Добавить();
        ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
        ДвижениеОстатки.Период = Дата;
        ДвижениеОстатки.Аквариум = Строка.Аквариум;
        ДвижениеОстатки.ПородаРыб = Строка.ПородаРыб;
        ДвижениеОстатки.Количество = Строка.Количество;
        ДвижениеОстатки.Стоимость = СебестоимостьСписания;
        
        ДвижениеПродажи = Движения.РегистрПродажи.Добавить();
        ДвижениеПродажи.Период = Дата;
        ДвижениеПродажи.Аквариум = Строка.Аквариум;
        ДвижениеПродажи.ПородаРыб = Строка.ПородаРыб;
        ДвижениеПродажи.Количество = Строка.Количество;
        ДвижениеПродажи.СуммаПродажи = Строка.Сумма;
        ДвижениеПродажи.Себестоимость = СебестоимостьСписания;
	
	КонецЦикла;
		
КонецПроцедуры
#КонецОбласти
